citrixhoneypot/logs/server.log

{"asctime": "2022-04-11 15:52:25,459", "levelname": "INFO", "message": "Citrix CVE-2019-19781 Honeypot by MalwareTech"}
{"asctime": "2022-04-11 16:40:13,755", "levelname": "INFO", "message": "(162.142.125.212:50140): POST Header: /"}
{"asctime": "2022-04-11 16:40:13,757", "levelname": "INFO", "message": "(162.142.125.212:50140): POST body: <?xml version=\"1.0\" encoding=\"UTF-8\"?><config-auth client=\"vpn\" type=\"init\"><version who=\"vpn\">4.8.03036</version><device-id>censys-inspect-1.0</device-id><capabilities><auth-method>multiple-cert</auth-method><auth-method>single-sign-on</auth-method><auth-method>single-sign-on-v2</auth-method></capabilities></config-auth>"}
{"asctime": "2022-04-11 16:42:00,941", "levelname": "INFO", "message": "(45.155.204.146:33980): GET Header: /"}
{"asctime": "2022-04-11 19:09:28,182", "levelname": "INFO", "message": "(162.142.125.212:56530): POST Header: /"}
{"asctime": "2022-04-11 19:09:28,185", "levelname": "INFO", "message": "(162.142.125.212:56530): POST body: <?xml version=\"1.0\" encoding=\"UTF-8\"?><config-auth client=\"vpn\" type=\"init\"><version who=\"vpn\">4.8.03036</version><device-id>censys-inspect-1.0</device-id><capabilities><auth-method>multiple-cert</auth-method><auth-method>single-sign-on</auth-method><auth-method>single-sign-on-v2</auth-method></capabilities></config-auth>"}
{"asctime": "2022-04-11 21:04:51,540", "levelname": "INFO", "message": "(45.155.205.120:59274): POST Header: /autodiscover/autodiscover.json?a=a@edu.edu/ews/exchange.asmx"}
{"asctime": "2022-04-11 21:04:51,543", "levelname": "INFO", "message": "(45.155.205.120:59274): POST body: <soap:Envelope\nxmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\nxmlns:m=\"http://schemas.microsoft.com/exchange/services/2006/messages\"\nxmlns:t=\"http://schemas.microsoft.com/exchange/services/2006/types\"\nxmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n<soap:Header>\n  <t:RequestServerVersion Version=\"Exchange2016\" />\n</soap:Header>\n<soap:Body>\n  <m:ResolveNames ReturnFullContactData=\"true\" SearchScope=\"ActiveDirectory\">\n    <m:UnresolvedEntry>SMTP:a</m:UnresolvedEntry>\n  </m:ResolveNames>\n</soap:Body>\n</soap:Envelope>"}
